# FILMS REVENUE DATA SCRAPPING FROM WIKIPEDIA.

In [1]:
# Import libraries
import requests
import csv
import json
from bs4 import BeautifulSoup
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# Web link
response = requests.get('https://en.wikipedia.org/wiki/List_of_highest-grossing_films#endnote_Rentals')

In [3]:
# soup Object
soup = BeautifulSoup(response.content)

In [4]:
# Scrap the data

def extract_wikipedia_table(url, table_class=None):
    """
    Extracts the contents of a table from a Wikipedia page.

    Args:
    url (str): The URL of the Wikipedia page.
    table_class (str, optional): The class name of the table to target. Defaults to None.

    Returns:
    list: A list of dictionaries containing the table data.
    """
    response = requests.get(url)
    soup = BeautifulSoup(response.text, 'html.parser')
    
    if table_class:
        table = soup.find('table', {'class': table_class})
    else:
        table = soup.find('table')
    
    headers = []
    for th in table.find_all('th'):
        headers.append(th.text.strip())
    
    rows = []
    for tr in table.find_all('tr')[1:]:
        cells = tr.find_all(['th', 'td'])
        if len(cells) > 0:
            row_data = {}
            for i, cell in enumerate(cells):
                row_data[headers[i]] = cell.text.strip()
            rows.append(row_data)
    
    return rows

# Target link
url = 'https://en.wikipedia.org/wiki/List_of_highest-grossing_films'
table_class = 'wikitable'  # Specify the class of the table
table_data = extract_wikipedia_table(url, table_class)

for row in table_data:
    print(row)

{'Rank': '1', 'Peak': '1', 'Title': 'Avatar', 'Worldwide gross': '$2,923,706,026', 'Year': '2009', 'Ref': '[# 1][# 2]'}
{'Rank': '2', 'Peak': '1', 'Title': 'Avengers: Endgame', 'Worldwide gross': '$2,797,501,328', 'Year': '2019', 'Ref': '[# 3][# 4]'}
{'Rank': '3', 'Peak': '3', 'Title': 'Avatar: The Way of Water', 'Worldwide gross': '$2,320,250,281', 'Year': '2022', 'Ref': '[# 5][# 6]'}
{'Rank': '4', 'Peak': '1', 'Title': 'Titanic', 'Worldwide gross': 'T$2,257,844,554', 'Year': '1997', 'Ref': '[# 7][# 8]'}
{'Rank': '5', 'Peak': '3', 'Title': 'Star Wars: The Force Awakens', 'Worldwide gross': '$2,068,223,624', 'Year': '2015', 'Ref': '[# 9][# 10]'}
{'Rank': '6', 'Peak': '4', 'Title': 'Avengers: Infinity War', 'Worldwide gross': '$2,048,359,754', 'Year': '2018', 'Ref': '[# 11][# 12]'}
{'Rank': '7', 'Peak': '6', 'Title': 'Spider-Man: No Way Home', 'Worldwide gross': '$1,922,598,800', 'Year': '2021', 'Ref': '[# 13][# 14]'}
{'Rank': '8', 'Peak': '3', 'Title': 'Jurassic World', 'Worldwide gross': '$1,671,537,444', 'Year': '2015', 'Ref': '[# 15][# 16]'}
{'Rank': '9', 'Peak': '7', 'Title': 'The Lion King', 'Worldwide gross': '$1,656,943,394', 'Year': '2019', 'Ref': '[# 17][# 4]'}
{'Rank': '10', 'Peak': '3', 'Title': 'The Avengers', 'Worldwide gross': '$1,518,815,515', 'Year': '2012', 'Ref': '[# 18][# 19]'}
{'Rank': '11', 'Peak': '4', 'Title': 'Furious 7', 'Worldwide gross': '$1,515,341,399', 'Year': '2015', 'Ref': '[# 20][# 21]'}
{'Rank': '12', 'Peak': '11', 'Title': 'Top Gun: Maverick', 'Worldwide gross': '$1,495,696,292', 'Year': '2022', 'Ref': '[# 22][# 23]'}
{'Rank': '13', 'Peak': '10', 'Title': 'Frozen II', 'Worldwide gross': '$1,450,026,933', 'Year': '2019', 'Ref': '[# 24][# 25]'}
{'Rank': '14', 'Peak': '14', 'Title': 'Barbie', 'Worldwide gross': '$1,445,638,421', 'Year': '2023', 'Ref': '[# 26][# 27]'}
{'Rank': '15', 'Peak': '5', 'Title': 'Avengers: Age of Ultron', 'Worldwide gross': '$1,402,809,540', 'Year': '2015', 'Ref': '[# 28][# 21]'}
{'Rank': '16', 'Peak': '16', 'Title': 'Inside Out 2 †', 'Worldwide gross': '$1,402,091,939', 'Year': '2024', 'Ref': '[# 29]'}
{'Rank': '17', 'Peak': '15', 'Title': 'The Super Mario Bros. Movie', 'Worldwide gross': '$1,361,992,475', 'Year': '2023', 'Ref': '[# 30][# 31]'}
{'Rank': '18', 'Peak': '9', 'Title': 'Black Panther', 'Worldwide gross': '$1,347,280,838', 'Year': '2018', 'Ref': '[# 32][# 33]'}
{'Rank': '19', 'Peak': '3', 'Title': 'Harry Potter and the Deathly Hallows – Part 2', 'Worldwide gross': '$1,342,139,727', 'Year': '2011', 'Ref': '[# 34][# 35]'}
{'Rank': '20', 'Peak': '9', 'Title': 'Star Wars: The Last Jedi', 'Worldwide gross': '$1,332,539,889', 'Year': '2017', 'Ref': '[# 36][# 37]'}
{'Rank': '21', 'Peak': '12', 'Title': 'Jurassic World: Fallen Kingdom', 'Worldwide gross': '$1,308,473,425', 'Year': '2018', 'Ref': '[# 38][# 12]'}
{'Rank': '22', 'Peak': '5', 'Title': 'Frozen', 'Worldwide gross': 'F$1,290,000,000', 'Year': '2013', 'Ref': '[# 39][# 40]'}
{'Rank': '23', 'Peak': '10', 'Title': 'Beauty and the Beast', 'Worldwide gross': '$1,263,521,126', 'Year': '2017', 'Ref': '[# 41][# 42]'}
{'Rank': '24', 'Peak': '15', 'Title': 'Incredibles 2', 'Worldwide gross': '$1,242,805,359', 'Year': '2018', 'Ref': '[# 43][# 12]'}
{'Rank': '25', 'Peak': '11', 'Title': 'The Fate of the Furious', 'Worldwide gross': 'F8$1,238,764,765', 'Year': '2017', 'Ref': '[# 44][# 42]'}
{'Rank': '26', 'Peak': '5', 'Title': 'Iron Man 3', 'Worldwide gross': '$1,214,811,252', 'Year': '2013', 'Ref': '[# 45][# 46]'}
{'Rank': '27', 'Peak': '10', 'Title': 'Minions', 'Worldwide gross': '$1,159,444,662', 'Year': '2015', 'Ref': '[# 47][# 16]'}
{'Rank': '28', 'Peak': '12', 'Title': 'Captain America: Civil War', 'Worldwide gross': '$1,153,337,496', 'Year': '2016', 'Ref': '[# 48][# 49]'}
{'Rank': '29', 'Peak': '20', 'Title': 'Aquaman', 'Worldwide gross': '$1,148,528,393', 'Year': '2018', 'Ref': '[# 50][# 12]'}
{'Rank': '30', 'Peak': '2', 'Title': 'The Lord of the Rings: The Return of the King', 'Worldwide gross': '$1,147,997,407', 'Year': '2003', 'Ref': '[# 51][# 52]'}
{'Rank': '31', 'Peak': '24RK', 'Title': 'Spider-Man: Far From Home', 'Worldwide gross': '$1,132,679,685', 'Year': '2019', 'Ref': '[# 53][# 4]'}
{'Rank': '32', 'Peak': '23RK', 'Title': 'Captain Marvel', 'Worldwide gross': '$1,128,274,794', 'Year': '2019', 'Ref': '[# 54][# 55]'}
{'Rank': '33', 'Peak': '5RK', 'Title': 'Transformers: Dark of the Moon', 'Worldwide gross': '$1,123,794,079', 'Year': '2011', 'Ref': '[# 56][# 35]'}
{'Rank': '34', 'Peak': '7', 'Title': 'Skyfall', 'Worldwide gross': '$1,108,569,499', 'Year': '2012', 'Ref': '[# 57][# 58]'}
{'Rank': '35', 'Peak': '10', 'Title': 'Transformers: Age of Extinction', 'Worldwide gross': '$1,104,054,072', 'Year': '2014', 'Ref': '[# 59][# 60]'}
{'Rank': '36', 'Peak': '7', 'Title': 'The Dark Knight Rises', 'Worldwide gross': '$1,081,169,825', 'Year': '2012', 'Ref': '[# 61][# 62]'}
{'Rank': '37', 'Peak': '31', 'Title': 'Joker', 'Worldwide gross': '$1,074,458,282', 'Year': '2019', 'Ref': '[# 63][# 25]'}
{'Rank': '38', 'Peak': '32', 'Title': 'Star Wars: The Rise of Skywalker', 'Worldwide gross': '$1,074,144,248', 'Year': '2019', 'Ref': '[# 64][# 25]'}
{'Rank': '39', 'Peak': '30', 'Title': 'Toy Story 4', 'Worldwide gross': '$1,073,394,593', 'Year': '2019', 'Ref': '[# 65][# 4]'}
{'Rank': '40', 'Peak': '4TS3', 'Title': 'Toy Story 3', 'Worldwide gross': '$1,066,970,811', 'Year': '2010', 'Ref': '[# 66][# 67]'}
{'Rank': '41', 'Peak': '3', 'Title': "Pirates of the Caribbean: Dead Man's Chest", 'Worldwide gross': '$1,066,179,747', 'Year': '2006', 'Ref': '[# 68][# 69]'}
{'Rank': '42', 'Peak': '20', 'Title': 'Rogue One: A Star Wars Story', 'Worldwide gross': '$1,057,420,387', 'Year': '2016', 'Ref': '[# 70][# 71]'}
{'Rank': '43', 'Peak': '34', 'Title': 'Aladdin', 'Worldwide gross': '$1,050,693,953', 'Year': '2019', 'Ref': '[# 72][# 4]'}
{'Rank': '44', 'Peak': '2', 'Title': 'Star Wars: Episode I – The Phantom Menace', 'Worldwide gross': '$1,046,515,409', 'Year': '1999', 'Ref': '[# 73][# 8]'}
{'Rank': '45', 'Peak': '6', 'Title': 'Pirates of the Caribbean: On Stranger Tides', 'Worldwide gross': '$1,045,713,802', 'Year': '2011', 'Ref': '[# 74][# 67]'}
{'Rank': '46', 'Peak': '1', 'Title': 'Jurassic Park', 'Worldwide gross': '$1,037,535,230', 'Year': '1993', 'Ref': '[# 75][# 76]'}
{'Rank': '47', 'Peak': '24', 'Title': 'Despicable Me 3', 'Worldwide gross': '$1,034,800,131', 'Year': '2017', 'Ref': '[# 77][# 42]'}
{'Rank': '48', 'Peak': '22', 'Title': 'Finding Dory', 'Worldwide gross': '$1,028,570,942', 'Year': '2016', 'Ref': '[# 78][# 79]'}
{'Rank': '49', 'Peak': '5', 'Title': 'Alice in Wonderland', 'Worldwide gross': '$1,025,468,216', 'Year': '2010', 'Ref': '[# 80][# 81]'}
{'Rank': '50', 'Peak': '24', 'Title': 'Zootopia', 'Worldwide gross': '$1,023,784,195', 'Year': '2016', 'Ref': '[# 82][# 49]'}

In [5]:
# Convert the list of dictionaries into a DataFrame
df = pd.DataFrame(table_data)

# Save the DataFrame to a CSV file
df.to_csv('highest_grossing_films.csv', index=False)

# First 5 rows of the dataframe
df.head()

  Rank Peak                         Title  Worldwide gross  Year          Ref
0    1    1                        Avatar   $2,923,706,026  2009   [# 1][# 2]
1    2    1             Avengers: Endgame   $2,797,501,328  2019   [# 3][# 4]
2    3    3      Avatar: The Way of Water   $2,320,250,281  2022   [# 5][# 6]
3    4    1                       Titanic  T$2,257,844,554  1997   [# 7][# 8]
4    5    3  Star Wars: The Force Awakens   $2,068,223,624  2015  [# 9][# 10]

## Data Cleaning

In [6]:
# Drop the `Ref` column 
df_clean = df.drop('Ref', axis=1)
df_clean.head()

  Rank Peak                         Title  Worldwide gross  Year
0    1    1                        Avatar   $2,923,706,026  2009
1    2    1             Avengers: Endgame   $2,797,501,328  2019
2    3    3      Avatar: The Way of Water   $2,320,250,281  2022
3    4    1                       Titanic  T$2,257,844,554  1997
4    5    3  Star Wars: The Force Awakens   $2,068,223,624  2015

In [7]:
# Check missing columns
df_clean.isnull().sum()

Rank               0
Peak               0
Title              0
Worldwide gross    0
Year               0
dtype: int64

In [8]:
# Information
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Rank             50 non-null     object
 1   Peak             50 non-null     object
 2   Title            50 non-null     object
 3   Worldwide gross  50 non-null     object
 4   Year             50 non-null     object
dtypes: object(5)
memory usage: 2.1+ KB

In [9]:
# Unique movies  in the dataset
df_clean['Title'].unique()

array(['Avatar', 'Avengers: Endgame', 'Avatar: The Way of Water',
       'Titanic', 'Star Wars: The Force Awakens',
       'Avengers: Infinity War', 'Spider-Man: No Way Home',
       'Jurassic World', 'The Lion King', 'The Avengers', 'Furious 7',
       'Top Gun: Maverick', 'Frozen II', 'Barbie',
       'Avengers: Age of Ultron', 'Inside Out 2 †',
       'The Super Mario Bros. Movie', 'Black Panther',
       'Harry Potter and the Deathly Hallows – Part 2',
       'Star Wars: The Last Jedi', 'Jurassic World: Fallen Kingdom',
       'Frozen', 'Beauty and the Beast', 'Incredibles 2',
       'The Fate of the Furious', 'Iron Man 3', 'Minions',
       'Captain America: Civil War', 'Aquaman',
       'The Lord of the Rings: The Return of the King',
       'Spider-Man: Far From Home', 'Captain Marvel',
       'Transformers: Dark of the Moon', 'Skyfall',
       'Transformers: Age of Extinction', 'The Dark Knight Rises',
       'Joker', 'Star Wars: The Rise of Skywalker', 'Toy Story 4',
       'Toy Story 3', "Pirates of the Caribbean: Dead Man's Chest",
       'Rogue One: A Star Wars Story', 'Aladdin',
       'Star Wars: Episode I – The Phantom Menace',
       'Pirates of the Caribbean: On Stranger Tides', 'Jurassic Park',
       'Despicable Me 3', 'Finding Dory', 'Alice in Wonderland',
       'Zootopia'], dtype=object)

In [12]:
# Renaming the 'Worldwide gross' to 'Revenue'
df_clean.rename(columns={'Rank' : 'Position','Worldwide gross' : 'Revenue'}, inplace=True)
df_clean.head()

  Position Peak                         Title          Revenue  Year
0        1    1                        Avatar   $2,923,706,026  2009
1        2    1             Avengers: Endgame   $2,797,501,328  2019
2        3    3      Avatar: The Way of Water   $2,320,250,281  2022
3        4    1                       Titanic  T$2,257,844,554  1997
4        5    3  Star Wars: The Force Awakens   $2,068,223,624  2015

In [13]:
# Save the Clean DataFrame to a CSV file
df_clean.to_csv('highest_grossing_films_clean.csv', index=False)